snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыШК/ВидыШК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыШК</name>
  <enumValues>
    <name>Основной</name>
  </enumValues>
  <enumValues>
    <name>Дополнительный</name>
  </enumValues>
  <enumValues>
    <name>Временный</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыКарточкиНоменклатурыВЧЗ/СтатусыКарточкиНоменклатурыВЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКарточкиНоменклатурыВЧЗ</name>
  <enumValues>
    <name>НеПодлежитМаркировке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкевНК</name>
  </enumValues>
  <enumValues>
    <name>НеСоздана</name>
  </enumValues>
  <enumValues>
    <name>Создана</name>
  </enumValues>
  <enumValues>
    <name>НаМодерации</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПодписания</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Опубликована</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыДокументовМаркировки/СтатусыДокументовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовМаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтложеннойОбработки</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработанЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ/ЗаказНаЭмиссиюКодовМаркировкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаЭмиссиюКодовМаркировкиСУЗ</name>
  <comment>Заказ на эмиссию кодов маркировки СУЗ</comment>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_ЧЗ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемаркировка</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ДокументаЧЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодовИзЧЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатурыЧЗВДокументе</name>
    <type>
      <types>EnumRef.ВидыНоменклатурыЧЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеНанесения</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВводаВОборот</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаЗапланирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКомплекта</name>
    <type>
      <types>EnumRef.ВидыКомплектов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплект</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодовКомплект</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ГТИН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомплект</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.Комплектация</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/CommonModules/МаркировкаВС/Module.bsl
Функция ПолучитьОсновнойШК(Номенклатура) Экспорт
	Результат = "";
	
	ШК = ПолучитьВсеШКТовара(Номенклатура, Перечисления.ТипыШтрихКодов.Штука, Перечисления.ВидыШК.Основной);
	
	Если ШК.Количество()=1 Тогда
		Результат = ШК[0].Наименование;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ПолучитьОсновнойШК(Номенклатура) Экспорт

Функция ПолучитьАдресСервераНК() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если Маркировка_ПИ.ИспользоватьПродуктовыйКонтурИСМП() И ОбщегоНазначения_ПИ.МожноЗапускатьАвтоОбмен() Тогда		
		Возврат "апи.национальный-каталог.рф";
	Иначе
		Возврат "integrators.nk.crptech.ru";
	КонецЕсли; 		

КонецФункции //ПолучитьАдресСервераНК() Экспорт

Функция ПолучитьАдресСервераСУЗ() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Маркировка_ПИ.ИспользоватьПродуктовыйКонтурИСМП() И ОбщегоНазначения_ПИ.МожноЗапускатьАвтоОбмен() Тогда
		Возврат "suzgrid.crpt.ru";
	Иначе
		Возврат "suz.sandbox.crptech.ru";
	КонецЕсли; 		

КонецФункции //ПолучитьАдресСервераСУЗ() Экспорт
 
Функция ПолучитьАдресСервераTrueApi() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Маркировка_ПИ.ИспользоватьПродуктовыйКонтурИСМП() И ОбщегоНазначения_ПИ.МожноЗапускатьАвтоОбмен() Тогда
		Возврат "markirovka.crpt.ru";
	Иначе
		Возврат "markirovka.sandbox.crptech.ru";
	КонецЕсли;

КонецФункции //ПолучитьАдресСервераTrueApi() Экспорт

Функция ЗафиксироватьРаботоспособностьЧЗ() Экспорт
	Если НЕ Маркировка_ПИ.ЧЗ_Живой() Тогда
		Константы.ДатаОтвалаЧЗ.Установить(Неопределено);		
		ОбновитьПовторноИспользуемыеЗначения();
		
		ЗаписатьВЛог("Работоспособность ЧЗ", "Восстановлена работа ЧЗ", "Информация");
	КонецЕсли;	
КонецФункции //ЗафиксироватьРаботоспособностьЧЗ() Экспорт

Функция ПолучитьМаркируемыеТоварыДокумента(ДокСсылка, ИмяТЧ = "Товары") Экспорт
	МетаДок = ДокСсылка.Метаданные();
	МетаТЧ	= МетаДок.ТабличныеЧасти[ИмяТЧ];
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура,	
	|	СУММА("+?(МетаТЧ.Реквизиты.Найти("Количество")<>Неопределено,"Количество","1")+") КАК Количество
	|ИЗ
	|	"+ДокСсылка.Метаданные().ПолноеИмя()+"."+ИмяТЧ+"
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|	И НЕ (
	|		Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка)
	|		ИЛИ Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеПодлежитМаркировке)
	|	)
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Наименование
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);	
	
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции //ПолучитьМаркируемыеТоварыДокумента(ДокСсылка, ИмяТЧ = "Товары") Экспорт
//++Данилова Е.В. 27.03.2025 по ГН 
Функция РазбитьТЧнаЧасти(тТовары, СтрокаНаДокумент = 10, МаксКоличествоПоПозиции = 1000, НомерЧасти = 0) Экспорт
	
	Части = Новый Массив;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Товары ИЗ &тТовары КАК тТовары
	|;
	|ВЫБРАТЬ
	|	Номенклатура,
	|	Номенклатура.ГТИН КАК ГТИН,
	|	СУММА(Количество) КАК Количество
	|ИЗ
	|	ВТ_Товары	
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|УПОРЯДОЧИТЬ ПО
	|	Количество УБЫВ
	|";
	
	Запрос.УстановитьПараметр("тТовары", тТовары);	
	
	Выборка 		= Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		Номенклатура	= Выборка.Номенклатура;
		НадоСписать 	= Выборка.Количество;		
		
		Пока НадоСписать > 0 Цикл
//			ОбработкаПрерыванияПользователя();
			
			ТекКол = Макс(0, Мин(НадоСписать, МаксКоличествоПоПозиции));		
			Если ТекКол > 0 Тогда
				ТекЧасть = Неопределено;
				Для Каждого Часть Из Части Цикл
					Если Часть.Количество() < СтрокаНаДокумент И Часть[Номенклатура] = Неопределено Тогда
						ТекЧасть = Часть;
						Прервать;
					КонецЕсли;				
				КонецЦикла; 	
				
				Если ТекЧасть = Неопределено Тогда
					ТекЧасть = Новый Соответствие;				
					Части.Добавить(ТекЧасть);
				КонецЕсли; 
				
				ТекЧасть[Номенклатура] = ТекКол;
				НадоСписать = НадоСписать - ТекКол;				
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла;	
	
	ТР = Новый ТаблицаЗначений;
	ТР.Колонки.Добавить("Часть", 		ПолучитьОписаниеТиповЧисла(9,0));
	ТР.Колонки.Добавить("Номенклатура",	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));	
	ТР.Колонки.Добавить("Количество", 	ПолучитьОписаниеТиповЧисла(12,0));
	//++Данилова Е.В. 27.03.2025 MARK-1288
	//Сч = 1;
	Сч = НомерЧасти + 1; 
	//--Данилова Е.В. 27.03.2025
	Для Каждого Часть Из Части Цикл		
		Для Каждого КиЗ Из Часть Цикл
			СтрокаТР = ТР.Добавить();
			
			СтрокаТР.Часть 			= Сч;
			СтрокаТР.Номенклатура   = КиЗ.Ключ;
			СтрокаТР.Количество		= КиЗ.Значение;			
		КонецЦикла; 
		Сч=Сч+1;
	КонецЦикла;
	//++Данилова Е.В. 27.03.2025 MARK-1922
	НомерЧасти = Сч; 
	//--Данилова Е.В. 27.03.2025
	Возврат ТР;	
КонецФункции

Функция ОтправитьНаОбработку_РегистрацияКарточекНоменклатурыВНК(ДокСсылка) Экспорт
	Обработка	= СоздатьОбработкуАПИ();		
	рВыполнения = Обработка.ОтправитьНаОбработку_РегистрацияКарточекНоменклатурыВНК(ДокСсылка);		
	Возврат рВыполнения;
КонецФункции //ОтправитьНаОбработку_РегистрацияКарточекНК(ДокСсылка)
//MARK-1946 добавлен параметр 
Функция ОтправитьНаОбработку_ЗаказКМ(ДокСсылка,ДопПараметры = неопределено,АдресВозврата  = неопределено) Экспорт
	Обработка	= СоздатьОбработкуАПИ();		
	рВыполнения = Обработка.ОтправитьНаОбработку_ЗаказКМ(ДокСсылка,ДопПараметры,АдресВозврата);		
	Возврат рВыполнения;
КонецФункции //ЗаказатьКоды(ДокСсылка)
 //MARK-1675 добавлен параметр
Функция ОтправитьНаОбработку_ОперМаркировки(ДокСсылка,ДопПараметры = неопределено,АдресВозврата = неопределено) Экспорт
	Обработка	= СоздатьОбработкуАПИ();	
	рВыполнения = Обработка.ОтправитьНаОбработку_ОперМаркировки(ДокСсылка,ДопПараметры,АдресВозврата);	
	Возврат рВыполнения;
КонецФункции //ОтправитьНаОбработку_ОперМаркировки(ДокСсылка)

Функция ОтправитьНаОбработку_ГенерацияГТИН(ДокСсылка) Экспорт
	Обработка	= СоздатьОбработкуАПИ();	
	рВыполнения = Обработка.ОтправитьНаОбработку_ГенерацияГТИН(ДокСсылка);	
	Возврат рВыполнения;
КонецФункции //ОтправитьНаОбработку_ЗапросКодовМаркировки(ДокСсылка)

Функция ОтправитьНаПовторноеПолучение(ДокСсылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если ЗначениеЗаполнено(ПолучитьРеквизитШапки(ДокСсылка, "ИД_ДокументаЧЗ")) Тогда
		НовыйСтатус = Перечисления.СтатусыДокументовМаркировки.Обрабатывается;		
	КонецЕсли; 
	УстановитьРеквизитыОбъекта(ДокСсылка, Новый Структура("Статус,ТекстОшибки", НовыйСтатус, ""), , Истина, Истина);
	
	Возврат Результат;
КонецФункции //ОтправитьНаПовторноеПолучение(ДокСсылка) Экспорт

Функция ОтправитьНаПовторнуюОбработку(ДокСсылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();	
	
	НовыйСтатус = Перечисления.СтатусыДокументовМаркировки.КОбработке;
	УстановитьРеквизитыОбъекта(ДокСсылка, Новый Структура("Статус,ТекстОшибки", НовыйСтатус, ""), , Истина, Истина);
	
	Возврат Результат;
КонецФункции //ОтправитьНаПовторнуюОбработку(ДокСсылка) Экспорт 

Функция ПолучитьРезультаты_РегистрацияКарточекНоменклатурыВНК(ДокСсылка) Экспорт
	Обработка	= СоздатьОбработкуАПИ();	
	Если 1=2 Тогда
		Обработка = Обработки.АпиЧЗ.Создать();	
	КонецЕсли; 
	
	рВыполнения = Обработка.ПолучитьРезультаты_РегистрацияКарточекНоменклатурыВНК(ДокСсылка);	
	Возврат рВыполнения;
КонецФункции //ПолучитьРезультаты_ЗаказКМ(ДокСсылка) Экспорт 
//MARK-1675 добавлен параметр
Функция ПолучитьРезультаты_ЗаказКМ(ДокСсылка,ДопПараметры=неопределено,АдресВозврата  = неопределено) Экспорт
	Обработка	= СоздатьОбработкуАПИ();	
	рВыполнения = Обработка.ПолучитьРезультаты_ЗаказКМ(ДокСсылка,ДопПараметры,АдресВозврата);	
	
	Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ОбновитьКоличествоПолученныхКодов(ДокСсылка);
	
	Возврат рВыполнения;
КонецФункции //ПолучитьРезультаты_ЗаказКМ(ДокСсылка) Экспорт 
//MARK-1675 добавлен параметр
Функция ПолучитьРезультаты_ОперМаркировки(ДокСсылка,ДопПараметры=неопределено,АдресВозврата  = неопределено) Экспорт
	Обработка	= СоздатьОбработкуАПИ();	
	рВыполнения = Обработка.ПолучитьРезультаты_ОперМаркировки(ДокСсылка,ДопПараметры,АдресВозврата);	
	Возврат рВыполнения;
КонецФункции //ПолучитьРезультаты_ОперМаркировки(ДокСсылка) Экспорт 

Функция ЗакрытьЗаказКМ(ДокСсылка) Экспорт
	Обработка	= СоздатьОбработкуАПИ();	
	рВыполнения = Обработка.ЗакрытьЗаказКМ(ДокСсылка);		
	
	Возврат рВыполнения;
КонецФункции //ЗакрытьЗаказКМ(ДокСсылка) Экспорт 

Функция СоздатьОбработкуАПИ() Экспорт
	Отладка = Ложь;
	
	Если Отладка Тогда
		ИмяФайла 	= Константы.КаталогВнешнихОтчетов.Получить()+"Маркировка\АпиЧЗ.epf";
	
		ОЗОД = Новый ОписаниеЗащитыОтОпасныхДействий;
		ОЗОД.ПредупреждатьОбОпасныхДействиях = Ложь;
		
		Обработка	= ВнешниеОбработки.Создать(ИмяФайла, Ложь, ОЗОД);		
	Иначе
		Обработка	= Обработки.АпиЧЗ.Создать();	
	КонецЕсли;	
	
	Возврат Обработка;
КонецФункции //СоздатьОбработкуАПИ(Отладка = Ложь)
 
Функция ПолучитьРеквизитШапки_(Ссылка, ИмяРеквизита, ТипОбъекта = Неопределено) Экспорт
	
	Возврат ПолучитьРеквизитШапки(Ссылка, ИмяРеквизита, ТипОбъекта);	

КонецФункции // ()

Функция ПолучитьМассивЗаписейЗагрузкиКМ(ЗаказКМ) Экспорт
	Обработка = СоздатьОбработкуАПИ();
	Возврат Обработка.ПолучитьМассивЗаписейЗагрузкиКМ(ЗаказКМ);
КонецФункции //ПолучитьМассивЗаписейЗагрузкиКМ(ЗаказКМ) Экспорт
